ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No write access detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal write access to DMU TX Event Element detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEED</name>
              <description>TX Event Element Dequeued</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No TX Event Element dequeued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>TX Event Element successfully dequeued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DT</name>
              <description>Debug Trigger</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Debug point not reached</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Debug point reached</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IAC</name>
              <description>Illegal Access while in Configuration mode</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Illegal Access while CCE mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal Access while CCE mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMUIE</name>
          <description>DMU Interrupt Enable</description>
          <addressOffset>0x3D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXENSAE</name>
              <description>TX Element Not Start Address Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Flag does not activate the interrupt line DMU</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>the interrupt line DMU will be activated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMUC</name>
          <description>DMU Configuration</description>
          <addressOffset>0x3D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TTS</name>
              <description>Transfer Timestamp</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No timestamp will be transferred via DMU Virtual Buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Timestamp of message will be transferred from TSU via DMU Virtual Buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_MCAN120</name>
      <description>MCAN 0</description>
      <baseAddress>0x2FBEF800</baseAddress>
      <alternatePeripheral>GLOBAL_DMU120</alternatePeripheral>
      <headerStructName>MCAN</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MCAN</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CREL</name>
          <description>Core Release Register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAY</name>
              <description>Time Stamp Day</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>MON</name>
              <description>Time Stamp Month</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>YEAR</name>
              <description>Time Stamp Year</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDN</name>
          <description>Endian Register</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETV</name>
              <description>Endianness Test Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CUST</name>
          <description>Customer Register</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>DBTP</name>
          <description>Data Bit Timing and Prescaler Register</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DSJW</name>
              <description>Data (Re)Synchronization Jump Width</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data time segment after sample point</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DTSEG1</name>
              <description>Data time segment before sample point</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>DBRP</name>
              <description>Data Bit Rate Prescaler</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>TDC</name>
              <description>Transmitter Delay Compensation</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Test Register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Loop Back Mode is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Loop Back Mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CanCore</name>
                  <description>controlled by the CAN Core, updated at the end of the CAN bit time</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Monitored</name>
                  <description>Sample Point can be monitored at pin m_can_tx</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dominant</name>
                  <description>Dominant (0) level at pin m_can_tx</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Recessive</name>
                  <description>Recessive (1) at pin m_can_tx</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>Receive Pin</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Dominant</name>
                  <description>The CAN bus is dominant (m_can_rx = 0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Recessive</name>
                  <description>The CAN bus is recessive (m_can_rx = '1')</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBNP</name>
              <description>Tx Buffer Number Prepared</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PVAL</name>
              <description>Prepared Valid</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Value of TXBNP not valid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Value of TXBNP valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBNS</name>
              <description>Tx Buffer Number Started</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>SVAL</name>
              <description>Started Valid</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Value of TXBNP not valid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Value of TXBNP valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <description>RAM Watchdog</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WDC</name>
              <description>Start value of the Message RAM Watchdog Counter. With the reset value of '00' the counter is
          disabled.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>WDV</name>
              <description>Actual Message RAM Watchdog Counter Value.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
