ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_PCGCM300</name>
      <description>PCGC Master 0</description>
      <baseAddress>0x4900F000</baseAddress>
      <headerStructName>PCGCMASTER</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PCGCMASTER</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SETPWRCONTHRESHOLDBASE[%s]</name>
          <description>Description collection: Set power consumption threshold base for power source / regulator n</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SETPWRCONTHRESHOLDBASE</name>
              <description>SETPWRCONTHRESHOLDBASE</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCKBACKDOORS</name>
          <description>Unlock backdoors</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNLOCKBACKDOORS</name>
              <description>Write: 0x00009375 to lock/unlock backdoors Read:  0x00000001 if backdoors is enabled Read:  0x00000000 if backdoors is disabled</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLEPOWERREGFORCE</name>
          <description>Enable power reg force</description>
          <addressOffset>0xC04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLEPOWERREGFORCE</name>
              <description>ENABLEPOWERREGFORCE</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>POWERREGFORCE</name>
          <description>Force reg</description>
          <addressOffset>0xC08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>POWERREGFORCEREG</name>
              <description>POWERREGFORCEREG</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x1</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MASTERFORCEREG[%s]</name>
          <description>Description collection: Force reg</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLEPSWITCHFORCE</name>
              <description>ENABLEPSWITCHFORCE</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>PSWITCHFORCEPRE</name>
              <description>PSWITCHFORCEPRE</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ENABLEISOLATIONFORCE</name>
              <description>ENABLEISOLATIONFORCE</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ISOLATIONFORCEPRE</name>
              <description>ISOLATIONFORCEPRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ENABLEARSTFORCE</name>
              <description>ENABLEARSTFORCE</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>VALUEARSTFORCEPRE</name>
              <description>VALUEARSTFORCEPRE</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ENABLEPOWERONFORCE</name>
              <description>ENABLEPOWERONFORCE</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>POWERONFORCEPRE</name>
              <description>POWERONFORCEPRE</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DISABLEWAITRESTORE</name>
              <description>Turn off waiting for arst deactivation before retention restore</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Turn off waiting for arst deactivation before retention restore</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Wait for arst deactivation before retention restore</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CLOCKFORCEREG[%s]</name>
          <description>Description collection: Force clock n</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable clock forcing</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CLOCKFORCING</name>
              <description>CLOCKFORCING</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CLOCKSOURCEFORCING</name>
              <description>CLOCKSOURCEFORCING</description>
              <lsb>2</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
