ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <name>KEEPRUNNING</name>
          <description>Request to keep the SYSCOUNTER in the active state and prevent going to sleep</description>
          <addressOffset>0x6A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DOMAIN_0</name>
              <description>Deprecated field -  Request from the Domain [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_1</name>
              <description>Deprecated field -  Request from the Domain [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_2</name>
              <description>Deprecated field -  Request from the Domain [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_3</name>
              <description>Deprecated field -  Request from the Domain [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_4</name>
              <description>Deprecated field -  Request from the Domain [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_5</name>
              <description>Deprecated field -  Request from the Domain [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_6</name>
              <description>Deprecated field -  Request from the Domain [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_7</name>
              <description>Deprecated field -  Request from the Domain [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_8</name>
              <description>Deprecated field -  Request from the Domain [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_9</name>
              <description>Deprecated field -  Request from the Domain [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_10</name>
              <description>Deprecated field -  Request from the Domain [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_11</name>
              <description>Deprecated field -  Request from the Domain [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_12</name>
              <description>Deprecated field -  Request from the Domain [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_13</name>
              <description>Deprecated field -  Request from the Domain [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_14</name>
              <description>Deprecated field -  Request from the Domain [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_15</name>
              <description>Deprecated field -  Request from the Domain [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_0</name>
              <description>Request from index [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_1</name>
              <description>Request from index [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_2</name>
              <description>Request from index [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_3</name>
              <description>Request from index [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_4</name>
              <description>Request from index [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_5</name>
              <description>Request from index [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_6</name>
              <description>Request from index [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_7</name>
              <description>Request from index [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_8</name>
              <description>Request from index [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_9</name>
              <description>Request from index [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_10</name>
              <description>Request from index [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_11</name>
              <description>Request from index [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_12</name>
              <description>Request from index [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_13</name>
              <description>Request from index [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_14</name>
              <description>Request from index [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQUEST_15</name>
              <description>Request from index [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Allow SYSCOUNTER to go to sleep</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Keep SYSCOUNTER active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT</name>
          <description>Timeout after all CPUs gone into sleep state to stop the SYSCOUNTER</description>
          <addressOffset>0x6A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Number of 32Ki cycles</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
