ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
              </enumeratedValues>
            </field>
            <field>
              <name>GRCPERIPH131</name>
              <description>Read pending status of interrupt for event GRCPERIPH1[31]</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND22</name>
          <description>Pending interrupts</description>
          <addressOffset>0x4B8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTEMOFFREADY</name>
              <description>Read pending status of interrupt for event SYSTEMOFFREADY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTEMOFFNOTREADY</name>
              <description>Read pending status of interrupt for event SYSTEMOFFNOTREADY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTEMOFFLOCALDOMAINOFF</name>
              <description>Read pending status of interrupt for event SYSTEMOFFLOCALDOMAINOFF</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPCONF</name>
          <description>Chip configuration</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONFREADY</name>
              <description>Chip configuration ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Chip configuration is not ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Chip configuration is completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMREADY</name>
              <description>Trim configuration ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Trim configuration is not ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Trim configuration is completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMPUP</name>
              <description>Ramp up done status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDone</name>
                  <description>Ramp up is not done</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Done</name>
                  <description>Ramp up is done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x504</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exit</name>
                  <description>Exit System OFF mode. Local domains are allowed to power on again.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enter into System OFF mode. Local domains are not allowed to be powered up once they are all powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEGDOFF</name>
              <description>Force global domain OFF</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Force</name>
                  <description>Enter into System OFF mode and force global domain off once all local domains are powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCESYSTEMOFFNOW</name>
              <description>Force System OFF mode immediately</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Force</name>
                  <description>Force System OFF mode and power all domains OFF mode immediately except Secure Domain.
            Secure Domain power itself down before the device enters System Off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTEMOFFIGNORESECDOM</name>
              <description>System OFF without considering Secure Domain</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Power state of secure domain is considered for SYSTEMOFFLOCALDOMAINOFF and secure domain is not allowed to wake up again after SYSTEMOFFLOCALDOMAINOFF.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Power state of secure domain is ignored for SYSTEMOFFLOCALDOMAINOFF and secure domain is allowed to both run during and wake up again after SYSTEMOFFLOCALDOMAINOFF.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFFSTAT</name>
          <description>System OFF status</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS_0</name>
              <description>System OFF status for power domain [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [0] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [0] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_1</name>
              <description>System OFF status for power domain [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [1] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [1] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_2</name>
              <description>System OFF status for power domain [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [2] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [2] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_3</name>
              <description>System OFF status for power domain [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [3] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [3] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_4</name>
              <description>System OFF status for power domain [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [4] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [4] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_5</name>
              <description>System OFF status for power domain [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [5] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [5] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_6</name>
              <description>System OFF status for power domain [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [6] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [6] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_7</name>
              <description>System OFF status for power domain [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [7] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [7] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_8</name>
              <description>System OFF status for power domain [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [8] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [8] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_9</name>
              <description>System OFF status for power domain [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [9] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [9] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_10</name>
              <description>System OFF status for power domain [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [10] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [10] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_11</name>
              <description>System OFF status for power domain [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [11] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [11] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_12</name>
              <description>System OFF status for power domain [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [12] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [12] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_13</name>
              <description>System OFF status for power domain [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [13] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [13] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_14</name>
              <description>System OFF status for power domain [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [14] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [14] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_15</name>
              <description>System OFF status for power domain [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Power domain [15] is ready to go to system OFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Prevent</name>
                  <description>Power domain [15] is preventing system OFF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
