ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
                    <description>The GRC active power domain remain Off even when GRC peripheral [27] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [27] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_28</name>
                <description>GRC peripheral identifier [28]</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [28] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [28] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_29</name>
                <description>GRC peripheral identifier [29]</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [29] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [29] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_30</name>
                <description>GRC peripheral identifier [30]</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [30] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [30] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_31</name>
                <description>GRC peripheral identifier [31]</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [31] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [31] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MASK1</name>
            <description>Mask the active power domain request due to interrupt from GRC peripheral identifier [63 : 32]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PERIPHID_0</name>
                <description>GRC peripheral identifier [0]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 0] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 0] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_1</name>
                <description>GRC peripheral identifier [1]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 1] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 1] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_2</name>
                <description>GRC peripheral identifier [2]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 2] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 2] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_3</name>
                <description>GRC peripheral identifier [3]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 3] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 3] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_4</name>
                <description>GRC peripheral identifier [4]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 4] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 4] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_5</name>
                <description>GRC peripheral identifier [5]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 5] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 5] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_6</name>
                <description>GRC peripheral identifier [6]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 6] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 6] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_7</name>
                <description>GRC peripheral identifier [7]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 7] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 7] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_8</name>
                <description>GRC peripheral identifier [8]</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 8] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 8] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_9</name>
                <description>GRC peripheral identifier [9]</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 9] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 9] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_10</name>
                <description>GRC peripheral identifier [10]</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 10] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 10] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_11</name>
                <description>GRC peripheral identifier [11]</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 11] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 11] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_12</name>
                <description>GRC peripheral identifier [12]</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 12] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 12] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_13</name>
                <description>GRC peripheral identifier [13]</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 13] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 13] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_14</name>
                <description>GRC peripheral identifier [14]</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 14] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 14] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_15</name>
                <description>GRC peripheral identifier [15]</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 15] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 15] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_16</name>
                <description>GRC peripheral identifier [16]</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 16] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 16] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_17</name>
                <description>GRC peripheral identifier [17]</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 17] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 17] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_18</name>
                <description>GRC peripheral identifier [18]</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 18] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 18] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_19</name>
                <description>GRC peripheral identifier [19]</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 19] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 19] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_20</name>
                <description>GRC peripheral identifier [20]</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 20] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 20] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_21</name>
                <description>GRC peripheral identifier [21]</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 21] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 21] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_22</name>
                <description>GRC peripheral identifier [22]</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 22] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
