ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PDREQSTATUS[%s]</name>
          <description>Description collection: Power domain request status</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATUS_0</name>
              <description>The power domain request status for power domain [n] * 32 + [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_1</name>
              <description>The power domain request status for power domain [n] * 32 + [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_2</name>
              <description>The power domain request status for power domain [n] * 32 + [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_3</name>
              <description>The power domain request status for power domain [n] * 32 + [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_4</name>
              <description>The power domain request status for power domain [n] * 32 + [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_5</name>
              <description>The power domain request status for power domain [n] * 32 + [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_6</name>
              <description>The power domain request status for power domain [n] * 32 + [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_7</name>
              <description>The power domain request status for power domain [n] * 32 + [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_8</name>
              <description>The power domain request status for power domain [n] * 32 + [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_9</name>
              <description>The power domain request status for power domain [n] * 32 + [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_10</name>
              <description>The power domain request status for power domain [n] * 32 + [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_11</name>
              <description>The power domain request status for power domain [n] * 32 + [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_12</name>
              <description>The power domain request status for power domain [n] * 32 + [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_13</name>
              <description>The power domain request status for power domain [n] * 32 + [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_14</name>
              <description>The power domain request status for power domain [n] * 32 + [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_15</name>
              <description>The power domain request status for power domain [n] * 32 + [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_16</name>
              <description>The power domain request status for power domain [n] * 32 + [16]</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_17</name>
              <description>The power domain request status for power domain [n] * 32 + [17]</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_18</name>
              <description>The power domain request status for power domain [n] * 32 + [18]</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_19</name>
              <description>The power domain request status for power domain [n] * 32 + [19]</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_20</name>
              <description>The power domain request status for power domain [n] * 32 + [20]</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_21</name>
              <description>The power domain request status for power domain [n] * 32 + [21]</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_22</name>
              <description>The power domain request status for power domain [n] * 32 + [22]</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_23</name>
              <description>The power domain request status for power domain [n] * 32 + [23]</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_24</name>
              <description>The power domain request status for power domain [n] * 32 + [24]</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_25</name>
              <description>The power domain request status for power domain [n] * 32 + [25]</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_26</name>
              <description>The power domain request status for power domain [n] * 32 + [26]</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_27</name>
              <description>The power domain request status for power domain [n] * 32 + [27]</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_28</name>
              <description>The power domain request status for power domain [n] * 32 + [28]</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_29</name>
              <description>The power domain request status for power domain [n] * 32 + [29]</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Power domain request is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power domain request is active</description>
