ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND3</name>
          <description>Pending interrupts</description>
          <addressOffset>0x46C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>INTPEND4</name>
          <description>Pending interrupts</description>
          <addressOffset>0x470</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOADCHANGERAIL0</name>
              <description>Read pending status of interrupt for event LOADCHANGERAIL[0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOADCHANGERAIL1</name>
              <description>Read pending status of interrupt for event LOADCHANGERAIL[1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOADCHANGERAIL2</name>
              <description>Read pending status of interrupt for event LOADCHANGERAIL[2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOADCHANGERAIL3</name>
              <description>Read pending status of interrupt for event LOADCHANGERAIL[3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>REQUEST</name>
          <description>Unspecified</description>
          <headerStructName>PCRM_REQUEST</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>STATUS</name>
            <description>Request status for consumers</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONSUMER_0</name>
                <description>Status of the request for consumer 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_1</name>
                <description>Status of the request for consumer 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_2</name>
                <description>Status of the request for consumer 2</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_3</name>
                <description>Status of the request for consumer 3</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_4</name>
                <description>Status of the request for consumer 4</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_5</name>
                <description>Status of the request for consumer 5</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_6</name>
                <description>Status of the request for consumer 6</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_7</name>
                <description>Status of the request for consumer 7</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_8</name>
                <description>Status of the request for consumer 8</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_9</name>
                <description>Status of the request for consumer 9</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_10</name>
                <description>Status of the request for consumer 10</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_11</name>
                <description>Status of the request for consumer 11</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_12</name>
                <description>Status of the request for consumer 12</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_13</name>
                <description>Status of the request for consumer 13</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_14</name>
                <description>Status of the request for consumer 14</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_15</name>
                <description>Status of the request for consumer 15</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_16</name>
                <description>Status of the request for consumer 16</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_17</name>
                <description>Status of the request for consumer 17</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_18</name>
                <description>Status of the request for consumer 18</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_19</name>
                <description>Status of the request for consumer 19</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_20</name>
                <description>Status of the request for consumer 20</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_21</name>
                <description>Status of the request for consumer 21</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_22</name>
                <description>Status of the request for consumer 22</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_23</name>
                <description>Status of the request for consumer 23</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_24</name>
                <description>Status of the request for consumer 24</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_25</name>
                <description>Status of the request for consumer 25</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_26</name>
                <description>Status of the request for consumer 26</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Falling</name>
                    <description>Request falling</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rising</name>
                    <description>Request rising</description>
                    <value>0x1</value>
                  </enumeratedValue>
