ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
                    <description>Ack received</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_28</name>
                <description>Ack status of the request for consumer [28]</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AckNotReceived</name>
                    <description>Ack not received</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AckReceived</name>
                    <description>Ack received</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_29</name>
                <description>Ack status of the request for consumer [29]</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AckNotReceived</name>
                    <description>Ack not received</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AckReceived</name>
                    <description>Ack received</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONSUMER_30</name>
                <description>Ack status of the request for consumer [30]</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AckNotReceived</name>
                    <description>Ack not received</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AckReceived</name>
                    <description>Ack received</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RAIL</name>
          <description>Unspecified</description>
          <headerStructName>PCRM_RAIL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x610</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>STATUS[%s]</name>
            <description>Description collection: Status of the rail n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Estimated value for the rail n</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>PCRM_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x650</addressOffset>
          <register>
            <dim>0x1F</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>LOAD[%s]</name>
            <description>Description collection: Load configuration table for consumer n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <!--LOAD_0.ResetValue = 0x00000001-->
            <!--LOAD_1.ResetValue = 0x00000001-->
            <!--LOAD_2.ResetValue = 0x00000000-->
            <!--LOAD_3.ResetValue = 0x0000000F-->
            <!--LOAD_4.ResetValue = 0x0000000F-->
            <!--LOAD_5.ResetValue = 0x0000000F-->
            <!--LOAD_6.ResetValue = 0x0000000F-->
            <!--LOAD_7.ResetValue = 0x0000000F-->
            <!--LOAD_8.ResetValue = 0x0000000F-->
            <!--LOAD_9.ResetValue = 0x00000001-->
            <!--LOAD_10.ResetValue = 0x00000001-->
            <!--LOAD_11.ResetValue = 0x00000001-->
            <!--LOAD_12.ResetValue = 0x00000001-->
            <!--LOAD_13.ResetValue = 0x00000001-->
            <!--LOAD_14.ResetValue = 0x00000001-->
            <!--LOAD_15.ResetValue = 0x0000000F-->
            <!--LOAD_16.ResetValue = 0x0000000F-->
            <!--LOAD_17.ResetValue = 0x00000000-->
            <!--LOAD_18.ResetValue = 0x00000001-->
            <!--LOAD_19.ResetValue = 0x0000000F-->
            <!--LOAD_20.ResetValue = 0x0000000F-->
            <!--LOAD_21.ResetValue = 0x0000000F-->
            <!--LOAD_22.ResetValue = 0x0000000F-->
            <!--LOAD_23.ResetValue = 0x0000000F-->
            <!--LOAD_24.ResetValue = 0x0000000F-->
            <!--LOAD_25.ResetValue = 0x0000000F-->
            <!--LOAD_26.ResetValue = 0x0000000F-->
            <!--LOAD_27.ResetValue = 0x0000000F-->
            <!--LOAD_28.ResetValue = 0x00000000-->
            <!--LOAD_29.ResetValue = 0x00000001-->
            <!--LOAD_30.ResetValue = 0x00000001-->
            <fields>
              <field>
                <name>VALUE</name>
                <description>Threshold value for the load for consumer n. NOTE: actual reset values vary across the register array.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>PCRM_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x750</addressOffset>
          <register>
            <dim>0x1F</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>REQUEST[%s]</name>
            <description>Description collection: Override the request for consumer n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the request for consumer n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Request cleared</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Request set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MASK</name>
                <description>Mask to override the request for consumer n</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Override value masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMask</name>
                    <description>Override value unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1F</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ACK[%s]</name>
            <description>Description collection: Override the Ack for the request for consumer n</description>
            <addressOffset>0x100</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override the Ack value for the request for consumer n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Ack clear</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Ack set</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MASK</name>
                <description>Mask to override the Ack for the request for consumer n</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Override value masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMask</name>
                    <description>Override value unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CROSSCURRENT[%s]</name>
            <description>Description collection: Override the cross current for rail n</description>
            <addressOffset>0x200</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the cross current for rail n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Cross current disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Cross current enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MASK</name>
                <description>Mask to override the cross current value for rail n</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Mask</name>
                    <description>Override value masked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMask</name>
                    <description>Override value unmasked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
