ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>CLOCK_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x450</addressOffset>
          <register>
            <name>SETUP</name>
            <description>Peripheral setup</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESET</name>
                <description>Reset the peripheral</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSLFLPRC</name>
                <description>Enable bypass LFLPRC</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSLFRC</name>
                <description>Enable bypass LFRC</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSLFXO</name>
                <description>Enable bypass LFXO</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYPASSSYNTH</name>
                <description>Enable bypass SYNTH</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIMEOUT</name>
                <description>Timeout for the clock alignment process</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>THRESHOLD</name>
            <description>Threshold limit while clock switching</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00043B14</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOW</name>
                <description>Threshold low limit while clock switching</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>Threshold high limit while clock switching</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>DIFF</name>
                <description>Threshold difference while clock switching</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>BACKDOORS</name>
          <description>Unspecified</description>
          <headerStructName>CLOCK_BACKDOORS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>REQSERVICECLK</name>
            <description>Backdoor request for service clocks</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CK16M</name>
                <description>Request 16M service clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRequested</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Requested</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKSIMOPWM</name>
                <description>Request SIMO PWM service clock</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRequested</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Requested</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
