ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <name>CLOCKSTATUS</name>
          <description>Clock status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>The FLL16M operating mode.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The PCGC controls the mode automatically.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpenLoop</name>
                  <description>Open loop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClosedLoop</name>
                  <description>Closed loop mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Refresh</name>
                  <description>Refresh mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass mode.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERRIDE</name>
              <description>FLL16M Override mode.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Override mode disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Override mode enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKSEL</name>
              <description>Clock selected</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCO16M</name>
                  <description>Clock from DCO16M selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>Clock from HFXO selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCURACY</name>
              <description>Clock accuracy.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OutsideLimit</name>
                  <description>Clock accuracy is outside 2 percent.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WithinLimit</name>
                  <description>Clock accuracy is within 2 percent.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKED</name>
              <description>The FLL16M lock status.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLocked</name>
                  <description>Not locked to reference clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Locked to reference clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOPE</name>
              <description>The calculated slope value.</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSANA</name>
          <description>Status of analog module output signals</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READYDCO16M</name>
              <description>Current value of the READY signal from the DCO16M analog module</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SETTLEDDCO16M</name>
              <description>Current value of the SETTLED signal from the DCO16M analog module</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>READYCKSW16M</name>
              <description>Current value of the READY signal from the CKSW16M analog module</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SETTLEDCKSW16M</name>
              <description>Current value of the SETTLED signal from the CKSW16M analog module</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CKSEL</name>
              <description>Current value of the CKSEL signal from the CKSW16M analog module</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>CFGCKSW16M</name>
            <description>CKSW16M configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SKEW</name>
                <description>configures the delay used in the phasedetector</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SkewNeg56kHz</name>
                    <description>DCO skew = -56 kHz.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SkewNeg160kHz</name>
                    <description>DCO skew = -160 kHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OVERRIDETRIM</name>
                <description>Enable override trim</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override trim is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override trim is enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>FREQM</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_FREQM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x420</addressOffset>
          <register>
            <name>DONE</name>
            <description>Frequency measurement done status</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DONE</name>
                <description>Measurement done.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InProgress</name>
                    <description>Frequency measurement is in progress.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Completed</name>
                    <description>Frequency measurement is completed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ERROR</name>
            <description>Frequency measurement error status</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERROR</name>
                <description>Error status.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OutsideLimit</name>
                    <description>Frequency exceeded the accuracy 0.5 percent in closed loop mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WithinLimit</name>
                    <description>Frequency stayed within accuracy 0.5 percent in closed loop mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MEAS</name>
            <description>Frequency measurement</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Last frequency measurement value.</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCKSEL</name>
            <description>Clock select for Frequency measurement</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKSEL</name>
                <description>Clock select</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DCO16M</name>
                    <description>Clock from DCO16M selected.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CKSW16M</name>
                    <description>Clock from CKSW16M selected.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HFXOBy2</name>
                    <description>Clock from 32MHz HFXO divided by 2 selected.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CKSW16MTestOsc</name>
                    <description>Clock from CKSW16M TESTOSC selected.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>RCOARSE</name>
            <description>Coarse frequency trimming</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Coarse frequency trimming value.</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RFINE</name>
            <description>Fine frequency trimming</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Fine frequency trimming value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TCOEF</name>
            <description>Temperature coefficient</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VSUP</name>
            <description>DCO16M internal DCO supply</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CKSW16MTRIM</name>
            <description>CKSW16M trim delay</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIRROR</name>
          <description>Enable LOCK for mirrored registers</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKDCO</name>
              <description>Lock for mirrored registers of DCO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKCKSW</name>
              <description>Lock for mirrored registers of CKSW</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CLOCKCTRL</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_CLOCKCTRL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x490</addressOffset>
          <register>
            <name>MODE</name>
            <description>Clock control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>The FLL16M operating mode.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Auto</name>
                    <description>The PCGC controls the mode automatically.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OpenLoop</name>
                    <description>Open loop mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ClosedLoop</name>
                    <description>Closed loop mode.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Refresh</name>
                    <description>Refresh mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass mode.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OVERRIDE</name>
                <description>FLL16M override mode.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override mode disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override mode enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLOCKSEL</name>
                <description>Clock select</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DCO16M</name>
                    <description>Clock from DCO16M selected.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HFXO</name>
                    <description>Clock from HFXO selected.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DITHERING</name>
            <description>Clock dithering configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00096733</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CYCLECOUNT</name>
                <description>Cycle count configuration for clock dithering</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MAXOFFSET</name>
                <description>Maximum offset configuration for clock dithering</description>
                <lsb>4</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>INITVALUE</name>
                <description>Initial value for the dithering</description>
                <lsb>8</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the clock dithering</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Clock dithering is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Clock dithering is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
