ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>Read pending status of interrupt for event READY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED</name>
              <description>Read pending status of interrupt for event SETTLED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOUTCMP</name>
              <description>Read pending status of interrupt for event IOUTCMP</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP2HP</name>
              <description>Read pending status of interrupt for event LP2HP</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP2LP</name>
              <description>Read pending status of interrupt for event HP2LP</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Voltage regulator status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Current voltage regulator mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HighPower</name>
                  <description>High power mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UltraLowPowerRefresh</name>
                  <description>Ultra-low power refresh mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSANA</name>
          <description>Status of analog module output signals</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>Current value of the READY signal from the analog module</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SETTLED</name>
              <description>Current value of the SETTLED signal from the analog module</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>IOUTCMP</name>
              <description>Current value of the IOUTCMP signal from the analog module</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>VREG1V0_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>CFGSTATIC</name>
            <description>Voltage regulator static CFG configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ULPRREFRESHCMPDIS</name>
                <description>Disable the ULPR refresh comparator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFTIMERDIV2</name>
                <description>Double the VREF timer</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ULPRREFRESHDIV2</name>
                <description>Double the ULPR refresh timer</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CURRCMPDIS</name>
                <description>Disable the current comparator</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPDOUBLEBIAS</name>
                <description>Double the LP core bias current</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ULPRREFOFFSET</name>
                <description>Offset of voltage reference in ULPR mode.</description>
                <lsb>5</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VRO00mV</name>
                    <description>0mV</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VRO10mV</name>
                    <description>10mV</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VRO20mV</name>
                    <description>20mV</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VRO30mV</name>
                    <description>30mV</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CFGDYNAMIC</name>
            <description>Voltage regulator dynamic CFG configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SOFTSTART</name>
                <description>Current limit configuration for the voltage regulator</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Auto</name>
                    <description>Automatically handled by the peripheral</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IlimHigh</name>
                    <description>Radio soft start</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IlimMid</name>
                    <description>WU soft start</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IlimLow</name>
                    <description>Reset current limit</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>VREG1V0_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>IREF</name>
            <description>Local current reference trimming</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current reference trimming value</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HIGHPOWER</name>
            <description>High power mode output voltage offset trimming</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOWPOWER</name>
            <description>Low power mode output voltage offset trimming</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPR</name>
            <description>ULPR mode comparator offset trimming</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Comparator offset trimming value.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIRROR</name>
          <description>Enable LOCK for mirrored registers</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock for mirrored registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTHPNOMINAL</name>
          <description>Nominal high power mode output voltage programming</description>
          <addressOffset>0x484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTHPRADIO</name>
          <description>Radio high power mode output voltage programming</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000002B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTHPHELPER</name>
          <description>High power helper mode output voltage programming</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000027</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTLPNOMINAL</name>
          <description>Nominal low power mode output voltage programming</description>
          <addressOffset>0x490</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTLPRADIO</name>
          <description>Radio low power mode output voltage programming</description>
          <addressOffset>0x494</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000027</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTULV</name>
          <description>ULV output voltage programming</description>
          <addressOffset>0x498</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Voltage regulator mode</description>
          <addressOffset>0x49C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>Automatically handled by the peripheral</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HighPower</name>
                  <description>High power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low power mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UltraLowPowerRefresh</name>
                  <description>Ultra-low power refresh mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITHRESHOLD</name>
          <description>Current threshold for mode transistion</description>
          <addressOffset>0x4A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Current consumption</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTHPHELPERRADIO</name>
          <description>Radio high power helper mode output voltage programming</description>
          <addressOffset>0x4A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000027</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUTHPHELPERWIFI</name>
          <description>Wi-Fi high power helper mode output voltage programming</description>
          <addressOffset>0x4A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000031</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
