ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>Write '1' to disable interrupt for event READY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED</name>
              <description>Write '1' to disable interrupt for event SETTLED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BPREADY</name>
              <description>Write '1' to disable interrupt for event BPREADY</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOUTCMPHP</name>
              <description>Write '1' to disable interrupt for event IOUTCMPHP</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOUTCMPLP</name>
              <description>Write '1' to disable interrupt for event IOUTCMPLP</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP2HP</name>
              <description>Write '1' to disable interrupt for event LP2HP</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP2LP</name>
              <description>Write '1' to disable interrupt for event HP2LP</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>Read pending status of interrupt for event READY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED</name>
              <description>Read pending status of interrupt for event SETTLED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BPREADY</name>
              <description>Read pending status of interrupt for event BPREADY</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOUTCMPHP</name>
              <description>Read pending status of interrupt for event IOUTCMPHP</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOUTCMPLP</name>
              <description>Read pending status of interrupt for event IOUTCMPLP</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP2HP</name>
              <description>Read pending status of interrupt for event LP2HP</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP2LP</name>
              <description>Read pending status of interrupt for event HP2LP</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Voltage regulator status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Current voltage regulator mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HighPower</name>
                  <description>High power mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low power refresh mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UltraLowPowerRefresh</name>
                  <description>Ultra-low power refresh mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSANA</name>
          <description>Status of analog module output signals</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READY</name>
              <description>Current value of the READY signal from the analog module</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SETTLED</name>
              <description>Current value of the SETTLED signal from the analog module</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>BPREADY</name>
              <description>Current value of the BPREADY signal from the analog module</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IOUTCMPHP</name>
              <description>Current value of the IOUTCMPHP signal from the analog module</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>IOUTCMPLP</name>
              <description>Current value of the IOUTCMPLP signal from the analog module</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>VREGAO0V8_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>CFGSTATIC</name>
            <description>VREGAO0V8 static CFG configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DOUBLEBIAS</name>
                <description>Configuration for double bias</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPICMP</name>
                <description>Configuration for LP ICMP</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LONGREFRESH</name>
                <description>Configuration for long refresh timer</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLEBPDET</name>
                <description>Configuration for disabling the BPDET</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Configuration disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Configuration enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRIMIBPP0</name>
                <description>LSB of IBPP trim</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>VREGAO0V8_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>IREF</name>
            <description>Local current reference trimming</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000008</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current reference trimming value</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HIGHPOWER</name>
            <description>High power mode output voltage offset trimming</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOWPOWER</name>
            <description>Low power mode output voltage offset trimming</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULTRALOWPOWER</name>
            <description>Ultra low power mode ripple trimming</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Ripple trimming value.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>5mV</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>15mV</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>25mV</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>35mV</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BPDET</name>
            <description>BP detector offset trimming</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
