ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VDETIO</name>
      <description>VDETIO peripheral</description>
      <baseAddress>0x5F974000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VDETIO</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Voltage detector status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWRGOOD_0</name>
              <description>Power good detector status for port [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_1</name>
              <description>Power good detector status for port [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_2</name>
              <description>Power good detector status for port [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_3</name>
              <description>Power good detector status for port [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_4</name>
              <description>Power good detector status for port [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_5</name>
              <description>Power good detector status for port [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_6</name>
              <description>Power good detector status for port [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_7</name>
              <description>Power good detector status for port [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_8</name>
              <description>Power good detector status for port [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_9</name>
              <description>Power good detector status for port [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>VDETIO_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x410</addressOffset>
          <register>
            <name>PWRGOOD</name>
            <description>Power good detector configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000037E</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN_0</name>
                <description>Enable the power good detector for port [0]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_1</name>
                <description>Enable the power good detector for port [1]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_2</name>
                <description>Enable the power good detector for port [2]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_3</name>
                <description>Enable the power good detector for port [3]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_4</name>
                <description>Enable the power good detector for port [4]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_5</name>
                <description>Enable the power good detector for port [5]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_6</name>
                <description>Enable the power good detector for port [6]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_7</name>
                <description>Enable the power good detector for port [7]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_8</name>
                <description>Enable the power good detector for port [8]</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN_9</name>
                <description>Enable the power good detector for port [9]</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>IO voltage detector is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>IO voltage detector is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
