ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPWMRDYHI</name>
              <description>Read pending status of interrupt for event FPWMRDYHI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPWMRDYLO</name>
              <description>Read pending status of interrupt for event FPWMRDYLO</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE0</name>
              <description>Read pending status of interrupt for event CURRABOVE[0]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE1</name>
              <description>Read pending status of interrupt for event CURRABOVE[1]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE2</name>
              <description>Read pending status of interrupt for event CURRABOVE[2]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE3</name>
              <description>Read pending status of interrupt for event CURRABOVE[3]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE4</name>
              <description>Read pending status of interrupt for event CURRABOVE[4]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE5</name>
              <description>Read pending status of interrupt for event CURRABOVE[5]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE6</name>
              <description>Read pending status of interrupt for event CURRABOVE[6]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE7</name>
              <description>Read pending status of interrupt for event CURRABOVE[7]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRABOVE8</name>
              <description>Read pending status of interrupt for event CURRABOVE[8]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW0</name>
              <description>Read pending status of interrupt for event CURRBELOW[0]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW1</name>
              <description>Read pending status of interrupt for event CURRBELOW[1]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW2</name>
              <description>Read pending status of interrupt for event CURRBELOW[2]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW3</name>
              <description>Read pending status of interrupt for event CURRBELOW[3]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW4</name>
              <description>Read pending status of interrupt for event CURRBELOW[4]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW5</name>
              <description>Read pending status of interrupt for event CURRBELOW[5]</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW6</name>
              <description>Read pending status of interrupt for event CURRBELOW[6]</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW7</name>
              <description>Read pending status of interrupt for event CURRBELOW[7]</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURRBELOW8</name>
              <description>Read pending status of interrupt for event CURRBELOW[8]</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>PMICC Status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000030</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPWMRDY</name>
              <description>State of PMIC fPwmRdy signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>fPwmRdy low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>fPwmRdy high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMSTATE</name>
              <description>State machine state</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PMICC has been disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>ULP or HV_REQ state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGDREQ</name>
                  <description>PGD_REQ state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODHPREQ</name>
                  <description>BOD_HP_REQ state</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HV</name>
                  <description>HV state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWMREQ</name>
                  <description>PWM_REQ state</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM</name>
                  <description>PWM state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODULPREQ</name>
                  <description>BOD_ULP_REQ state</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ITHRESHOLD[%s]</name>
          <description>Description collection: Current threshold</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000032</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>THRES</name>
              <description>Current threshold</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDE</name>
          <description>Override request outputs</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPWMREQEN</name>
              <description>Whether to force PMIC fPwmReq</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Not forcing fPwmReq</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Forcing fPwmReq to value in FPWMREQVAL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPWMREQVAL</name>
              <description>Value to force PMIC fPwmReq to</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>HVREQEN</name>
              <description>Whether to force PMIC HVReq</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Not forcing HVReq</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Forcing HVReq to value in HVREQVAL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HVREQVAL</name>
              <description>Value to force PMIC HVReq to</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
