ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl.svd
    <peripheral derivedFrom="PPIB110">
      <name>PPIB135</name>
      <description>PPIB APB registers 8</description>
      <baseAddress>0x5F9BD000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCS200">
      <name>PCGCS136</name>
      <description>PCGCSlave 11</description>
      <baseAddress>0x5F9BE000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCM200">
      <name>PCGCM136</name>
      <description>PCGC Master 11</description>
      <baseAddress>0x5F9BF000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC135</name>
      <description>Distributed programmable peripheral interconnect controller 6</description>
      <baseAddress>0x5F9C1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER134</name>
      <description>Timer/Counter 6</description>
      <baseAddress>0x5F9C2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER134</name>
        <value>450</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER135</name>
      <description>Timer/Counter 7</description>
      <baseAddress>0x5F9C3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER135</name>
        <value>451</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM132</name>
      <description>Pulse width modulation unit 3</description>
      <baseAddress>0x5F9C4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM132</name>
        <value>452</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM134</name>
      <description>Serial Peripheral Interface Master with EasyDMA 8</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS134</name>
      <description>SPI Slave 5</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM134</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 4</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS134</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 4</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE134</name>
      <description>UART with EasyDMA 5</description>
      <baseAddress>0x5F9C5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM134</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL4</name>
        <value>453</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM135</name>
      <description>Serial Peripheral Interface Master with EasyDMA 9</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS135</name>
      <description>SPI Slave 6</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM135</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 5</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS135</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 5</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE135</name>
      <description>UART with EasyDMA 6</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130">
      <name>GLOBAL_PDM132</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 2</description>
      <baseAddress>0x5F9C7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM132</name>
        <value>455</value>
      </interrupt>
    </peripheral>
